public class Deposit{
    long customer_number;
    float amount;
    int duration;
    String deposit_type;
    void calculate(){
    }
}
/*
بهتره شماره مشتری  رو استرینگ بگیری. کلا هر چیزی که نمیخوای یا نمیتونی دوتاشو با هم جمع کنی، بهتره که استرینگ باشن.
برای امانت هم یه موجودی معرفی کردم توی کی‌وردها به اسم بیگ دسیمال که بهتره از اون استفاده کنی. واسه عددای خیلی بزرگه
و اما دیپازیت تایپ. این باید به خود کلاس دیپازیت تایپ وصل باشه. یعنی یه متغیر از جنس کلاس دیپازیت تایپ توی این داشته باشی
درباره رابطه اسوسیشن بخون
*/
